In [1]:
import pandas as pd
import os

In [2]:
# Since the csv file is located in it's parent sub folder.
fileDir = os.path.dirname(os.path.realpath('__file__'))
loc_rel = os.path.join(fileDir, '../datasets/1/summer.csv')
loc_abs = os.path.abspath(os.path.realpath(loc_rel))

In [3]:
summer_df = pd.read_csv(loc_abs)
summer_df.head()

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze
3,1896,Athens,Aquatics,Swimming,"MALOKINIS, Ioannis",GRE,Men,100M Freestyle For Sailors,Gold
4,1896,Athens,Aquatics,Swimming,"CHASAPIS, Spiridon",GRE,Men,100M Freestyle For Sailors,Silver

In [4]:
summer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31165 entries, 0 to 31164
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        31165 non-null  int64
 1   City        31165 non-null  object
 2   Sport       31165 non-null  object
 3   Discipline  31165 non-null  object
 4   Athlete     31165 non-null  object
 5   Country     31161 non-null  object
 6   Gender      31165 non-null  object
 7   Event       31165 non-null  object
 8   Medal       31165 non-null  object
dtypes: int64(1), object(8)
memory usage: 2.1+ MB

In [5]:
# Re-Indexing the dataframe.
summer_df_rein = pd.read_csv(loc_rel, index_col='Athlete')
summer_df_rein.head()

,Year,City,Sport,Discipline,Country,Gender,Event,Medal
Athlete,,,,,,,,
"HAJOS, Alfred",1896,Athens,Aquatics,Swimming,HUN,Men,100M Freestyle,Gold
"HERSCHMANN, Otto",1896,Athens,Aquatics,Swimming,AUT,Men,100M Freestyle,Silver
"DRIVAS, Dimitrios",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Bronze
"MALOKINIS, Ioannis",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Gold
"CHASAPIS, Spiridon",1896,Athens,Aquatics,Swimming,GRE,Men,100M Freestyle For Sailors,Silver

In [6]:
# Fetching the first row using iloc[] method.
summer_df_rein.iloc[0]

Year                    1896
City                  Athens
Sport               Aquatics
Discipline          Swimming
Country                  HUN
Gender                   Men
Event         100M Freestyle
Medal                   Gold
Name: HAJOS, Alfred, dtype: object

In [7]:
# Fetching the last row.
summer_df_rein.iloc[-1]

Year                         2012
City                       London
Sport                   Wrestling
Discipline    Wrestling Freestyle
Country                       SWE
Gender                        Men
Event                    Wg 96 KG
Medal                      Bronze
Name: LIDBERG, Jimmy, dtype: object

In [8]:
# Updating the index to start from 1 isted of 0 (i.e. default)
summer_df.index = summer_df.index + 1

In [9]:
# Fetching the first 3 rows.
summer_df.iloc[[0,1,2]]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
1,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
2,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
3,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [10]:
# Resetting the index.
summer_df.index = summer_df.index - 1

In [11]:
# Other way of fetching the first 3 rows.
summer_df.iloc[0:3]

# In here it starts with first digit but excludes the last postion.

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [12]:
# OR
summer_df[:3]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze

In [13]:
# Last 3 rows.
summer_df[-3:]

,Year,City,Sport,Discipline,Athlete,Country,Gender,Event,Medal
31162,2012,London,Wrestling,Wrestling Freestyle,"TOTROV, Rustam",RUS,Men,Wg 96 KG,Silver
31163,2012,London,Wrestling,Wrestling Freestyle,"ALEKSANYAN, Artur",ARM,Men,Wg 96 KG,Bronze
31164,2012,London,Wrestling,Wrestling Freestyle,"LIDBERG, Jimmy",SWE,Men,Wg 96 KG,Bronze

In [14]:
# Lets say we need a specific value from a particular row, first row 5th column.
summer_df.iloc[0,4]

'HAJOS, Alfred'

In [15]:
# Lets say we need a specific value from a particular row, first row 2nd to 5th column.
summer_df.iloc[0,2:4]

Sport         Aquatics
Discipline    Swimming
Name: 0, dtype: object

In [16]:
# Lets say we need a specific value from a particular row, first row specific columns.
summer_df.iloc[0,[2,4,6]]

Sport           Aquatics
Athlete    HAJOS, Alfred
Gender               Men
Name: 0, dtype: object

In [17]:
# Similarly the same operation can also be performed at column level.
summer_df.iloc[[2,4,6],4]

2     DRIVAS, Dimitrios
4    CHASAPIS, Spiridon
6         HAJOS, Alfred
Name: Athlete, dtype: object